speciesstring = '{"Near-Human": {"name": "Near-Human","description": "Humans dominate the Core Worlds and can be found in virtually every corner of the galaxy. They are the ancestors of early spacefaring pioneers, conquerors, traders, travelers, and refugees. Near-Humans have always been people on the move. As a result, they can be found on almost every inhabited planet. As a Species, Near-Humans are physically, culturally, and politically diverse. Hardy or fine, light-skinned or dark, Near-Humans remain one of the most dominant Species throughout all eras of play.","example-names": ["Anakin","Arani","Bail","Ben","Biggs","Boba","Corran","Dack","Dané","Galak","Garm","Han","Jango","Jodo","Lando","Leia","Luke","Mace","Mara","Obi-Wan","Owen","Padmé","Qui-Gon","Sia-Lan","Rann","Talon","Vor\'en","Wedge","Winter"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Bonus Feat","description": "Near-Humans gain one bonus Feat at 1st level."},{"name": "Bonus Trained Skill","description": "Near-Humans choose one additional Trained Skill at 1st level from the character\'s list of Class Skills."},{"name": "Ability Adjustment","description": "Increase one Ability Score by 2 and reduce another by 2 to account for emphasis in certain attributes."},{"name": "Additional Arms","description": "Up to 2 additional arms. When making multiple attacks, the character can reduce the penalty to the attack roll by 2."},{"name": "Biotech Augmentation","description": "Select one Bio-Implant at Character Creation."},{"name": "Breathe Underwater","description": "Amphibious and cannot drown in water. Can have gill slits or similar external features."},{"name": "Climate Adaptation","description": "Resistant to a specific climate. Select one: freezing, rarefied atmosphere, searing, smoky, tropical, or watery."},{"name": "Conductive","description": "Naturally generate a small amount of electrical energy and use as a Natural Weapon in an Unarmed attack."},{"name": "Cultural Cybernetics","description": "Culture commonly augments members with cybernetics from birth. Select one Cybernetic Enhancement at Character Creation."},{"name": "Darkvision","description": "Can ignore Concealment (including Total Concealment) from darkness."},{"name": "Empath","description": "Can use the Telepathy application of the Use the Force skill Untrained, and without having the Force Sensitivity Feat."},{"name": "Expert Swimmer","description": "Can reroll a Swim check, but the result of the reroll must be accepted, even if it is worse. Can Take 10 on Swim checks when distracted or threatened."},{"name": "Heightened Awareness","description": "Can reroll a Perception check, but the result of the reroll must be accepted, even if it is worse."},{"name": "Low-Light Vision","description": "Can ignore Concealment (but not Total Concealment) from darkness."},{"name": "Natural Armor","description": "Thickened skin or natural armor plates grant a Natural Armor bonus of +1 to Reflex Defense."},{"name": "Natural Weapon","description": "Can use natural claws in an Unarmed attack, dealing 1d6 points of Slashing damage."},{"name": "Naturally Acrobatic","description": "Considered Trained in the Acrobatics skill, even if it is not normally a Class Skill for the character."},{"name": "Persistent","description": "Can reroll an Endurance check, but the result of the reroll must be accepted, even if it is worse."},{"name": "Quick","description": "Increases Base Speed by 1 square."},{"name": "Quick Healing","description": "At the end of an encounter, one body part becomes un-cripple."},{"name": "Resistant","description": "Naturally resistant to Poisons, Diseases, Radiation, or other Hazards, gaining a +2 Species bonus to Fortitude Defense."},{"name": "Scent","description": "At close range (within 10 spaces), ignore Concealment and Cover for purposes of Perception checks."},{"name": "Spring Step","description": "When using the High Jump or Long Jump applications of the Jump skill, reduce the number of spaces required for a running start by 2."},{"name": "Strength Surge","description": "Once per encounter, can reroll one Strength-based Ability or Skill Check, doubling the character\'s Strength modifier, or can add 2 to a single damage roll on a successful melee attack."},{"name": "Visually Striking","description": "Character\'s appearance is visually surprising or stunning. The character\'s Charisma bonus is doubled when using the Persuasion skill on Humans, Near-Humans, and similar humanoids."},{"name": "Weapon Familiarity","description": "Character selects a single Exotic Weapon and treats it as a Simple Weapon instead."}],"automatic-language": ["Basic"]}},"Bith": {"name": "Bith","description": "Bith have been part of The Galactic Republic for thousands of years. Intellectually advanced humanoids, Bith have over-sized brains evolved to handle abstract skills such as language, mathematics, music, and scientific analysis.","example-names": ["Doikk","Figrin","Jinkins","Lirin","Nalan","Tech","Tedn","Thai"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": -2,"int": 2,"wis": 0,"cha": 2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Evolved Intellect","description": "Whenever a Bith spends a Force Point for any reason, the Bith gains a temporary Force Point, that can only be spent to add to an Intelligence-based Skill Check."},{"name": "Meditative Trance","description": "Bith can enter into a Trance that lasts for four consecutive hours. At the end of the Trance, they gain the benefits of having rested for eight consecutive hours."},{"name": "Scent","description": "Bith have a keen sense of smell. At close range (within 10 spaces), Bith ignore Concealment and Cover for purposes of Perception checks."}],"automatic-language": ["Basic","Bith"]}},"Bothan": {"name": "Bothan","description": "Native to Bothawui, these short, fur-covered humanoids have had hyperspace travel for thousands of years. Bothans use information as a measure of wealth and power, even wielding it as a weapon when necessary.","example-names": ["Borsk Fey\'lya","Karka Kre\'fey","Koth Melan","Tav Breil\'lya","Tereb Ab\'lon"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 2,"con": -2,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "Bothans are natural spies and investigators. A Bothan with Gather Information as a Trained Skill gains Skill Focus (Gather Information) as a bonus Feat."},{"name": "Iron Will","description": "Bothans have above-average willpower and gain a +2 Species bonus to their Will Defense."}],"automatic-language": ["Basic","Bothese"]}},"Cerean": {"name": "Cerean","description": "Cereans are a sophisticated and cultured humanoid Species native to Cerea, a world on the fringes of known space. Their elongated heads distinguish them from most other humanoid Species.","example-names": ["Ki-Adi","So Leet","Sylvn","Ti-Dal","Maj-Odo"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": -2,"con": 0,"int": 2,"wis": 2,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "A Cerean with Initiative as a Trained Skill gains Skill Focus (Initiative) as a bonus Feat."},{"name": "Intuitive Initiative","description": "Despite their general lack of coordination, Cereans\' reaction speed is superior to that of most other Species."}],"automatic-language": ["Basic","Cerean"]}},"Clawdite": {"name": "Clawdite","description": "Clawdites, a genetically engineered offshoot of Zolanders, possess the ability to shapechange. Originally sequestered in ghettos by Zolanders due to their perceived treachery, Clawdites eventually rose up against their captors and gained control of their homeworld. They are staunchly committed to freedom and detest opposition in all its forms.","example-names": ["Durbat","Renneyn","Rolsat Noviee","Torsayn","Zam Wesell"],"species-traits": {"ability-score-adjustment": {"str": -2,"dex": 0,"con": 0,"int": 0,"wis": 0,"cha": 2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Shapeshift","description": "Clawdites can alter their appearance at will, assuming the form of any humanoid species of Medium size. While shapeshifted, they gain a +10 species bonus on Deception checks made to disguise their appearance."},{"name": "Startle","description": "Once per encounter, as a reaction to being attacked, a Clawdite can make a Deception check against the attacker\'s Will Defense. If successful, the attacker takes a -5 penalty on their attack roll."}],"automatic-language": ["Basic","Clawdite"]}},"Codru-Ji": {"name": "Codru-Ji","description": "Codru-Ji, isolated and xenophobic, are a six-limbed species with a strong emphasis on family ties. They abduct individuals for political reasons and have rituals around their six-legged juvenile form. Suspicious of outsiders, Codru-Ji are nonetheless fiercely protective of their loved ones.","example-names": ["Adaavi","Deceven","Jorrdu","Ketanna","Merasska","Raiko","Veesani","Zallfric"],"species-traits": {"ability-score-adjustment": {"str": -2,"dex": 0,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Extra Arms","description": "Codru-Ji can hold up to four items or weapons at a time, gaining bonuses and penalties depending on the combination of weapons wielded."},{"name": "Skilled Grappler","description": "Due to their extra arms, Codru-Ji gain a +5 species bonus to both Grab and Grapple checks."}],"automatic-language": ["Basic","Codruese"]}},"Devaronian": {"name": "Devaronian","description": "Devaronians, recognizable by their red skin and horned heads, are trioecious, with three sexes. Males are bold and adventurous, females are wise and protective, while hermaphrodites vary between the two. They possess innate curiosity and masterful manipulation skills.","example-names": ["Dmaynel Kiph","Elassar Targon","Jubal","Kapp Dendo","Tyrn Jiton","Lak Jit","Oxbel","Saricia","Sires Vant","Trynic","Ulicx Vinaq","Vilmarh Grahrk"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 2,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "Devaronians are master manipulators. A Devaronian with Deception as a trained skill gains Skill Focus (Deception) as a bonus feat."},{"name": "Natural Curiosity","description": "Once per encounter as a standard action, a Devaronian can make a Perception check against a single target within line of sight to gain a +1 insight bonus on attack rolls against that target."}],"automatic-language": ["Basic","Devaronese"]}},"Duros": {"name": "Duros","description": "Tall, hairless humanoids from the Duro System, Duros were one of the first Species to become a major influence in the Galactic Republic. They have a natural affinity for space travel and possess an innate grasp of astrogational computations.","example-names": ["Baniss Keeg","Elior","Kadlo","Kir Vantai","Lai Nootka","Monnda Tebbo"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 2,"con": -2,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Expert Pilot","description": "A Duros may choose to reroll any Pilot check, but must accept the result of the reroll even if it\'s worse."}],"automatic-language": ["Basic","Durese"]}},"Ewok": {"name": "Ewok","description": "Intelligent omnivores native to one of the moons orbiting Endor. Ewoks are clever, inventive, and live in tree-dwelling tribes. They are known for their curiosity and courage.","example-names": ["Asha","Chirpa","Deej","Kneesaa","Latara","Logray","Malani","Nippet","Paploo","Shodu","Teebo","Wicket","Wiley"],"species-traits": {"ability-score-adjustment": {"str": -2,"dex": 2,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Small","speed": 4,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "An Ewok with Survival as a Trained Skill gains Skill Focus (Survival) as a bonus Feat."},{"name": "Sneaky","description": "An Ewok may choose to reroll any Stealth check, but must accept the result of the reroll even if it\'s worse."}],"automatic-language": ["Ewokese"]}},"Falleen": {"name": "Falleen","description": "The Falleen are exotic reptilian humanoids known for their intoxicating appearance and entrancing features. They possess pheromones that make them irresistible to other Species.","example-names": ["Savan","Xad","Xist","Xizor","Xora","Zule","Zurros"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 0,"int": 0,"wis": -2,"cha": 2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Hold Breath","description": "A Falleen can hold their breath for a number of rounds equal to 25 times their Constitution score before needing to make Endurance checks."},{"name": "Pheromones","description": "As a Standard Action, a Falleen can make a special attack using their pheromones to influence the attitude of adjacent creatures."}],"automatic-language": ["Basic","Falleen"]}},"Gungan": {"name": "Gungan","description": "The Gungans are omnivorous humanoids native to the swamps of Naboo. They are technologically advanced and have a peaceful culture, though they admire strength and cunning.","example-names": ["Fassa","Jar Jar","Rugor","Tarpals","Toba","Tobler Ceel","Yoss"],"species-traits": {"ability-score-adjustment": {"str": -2,"dex": 2,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": {"land": 6,"swim": 4},"bonus-traits": [{"name": "Expert Swimmer","description": "A Gungan may choose to reroll any Swim check, but must accept the result of the reroll even if it\'s worse."},{"name": "Lightning Reflexes","description": "Gungans gain a +2 Species bonus to their Reflex Defense."}],"automatic-language": ["Gunganese"]}},"Hutt": {"name": "Hutt","description": "Hutts are long-lived gastropods who occupy a region known as Hutt Space. They are powerful, ruthless beings who continually seek to expand the boundaries of their dominion and the holdings of their individual clans, or Kajidics.","example-names": ["Borga","Churabba","Dalla","Durga","Gardulla","Grelb","Grondo","Issulla","Jabba","Krova","Mardoc","Mika","Nullada","Popara","Shala","Yarella","Zonnos","Zordo"],"species-traits": {"ability-score-adjustment": {"str": 2,"dex": 0,"con": 2,"int": 2,"wis": 0,"cha": 0,"wil": 0},"size": "Large","speed": 2,"bonus-traits": [{"name": "Cumbersome","description": "Hutts have a -5 penalty for all Acrobatic, Climb, Jump, and Ride skills."},{"name": "Force Resistance","description": "A Hutt\'s sharp mind allows them to resist Force abilities. Hutts receive a +5 bonus to their Will Defense against any use of the Use the Force skill."},{"name": "Supreme Stability","description": "A Hutt\'s sluglike body structure and lack of any kind of legs allows a Hutt to become completely immune to being knocked Prone."},{"name": "Silver Tongued","description": "Hutts may be known to be heavy-handed in their ventures, but they are equally capable in legal negotiations as they are in underground business. A Hutt may choose to reroll any Persuasion check, keeping the better of the two results."}],"automatic-language": ["Basic","Huttese"]}},"Jawa": {"name": "Jawa","description": "Jawas are short humanoids native to Tatooine. They have a poor reputation and are regarded as thieves at best, vermin at worst. Jawas survive by scavenging lost technology in the desert wastes.","example-names": ["Akkit","Het","Oklect","Klepti","Tikkit","Tteel"],"species-traits": {"ability-score-adjustment": {"str": -2,"dex": 2,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Small","speed": 4,"bonus-traits": [{"name": "Darkvision","description": "Jawas ignore Concealment (including Total Concealment) from darkness. However, they cannot perceive colors in total darkness."},{"name": "Desert Dweller","description": "When making Survival checks to resist the effects of Extreme Heat, Jawas can reroll the check, keeping the better of the two results."},{"name": "Scavenger","description": "Whenever a Jawa armed with an Ion weapon successfully damages a Droid or Vehicle, the Jawa adds half their Character Level in Ion damage."},{"name": "Tinkerer","description": "A Jawa can choose to reroll any Mechanics check, but must keep the second result, even if it is worse. In addition, Mechanics is always a Class Skill for Jawas."}],"automatic-language": ["Jawaese","Jawa Trade Language"]}},"Kaleesh": {"name": "Kaleesh","description": "The Kaleesh are a nomadic Species with a tribal culture. They are spiritual beings who worship their ancestors as deities and consider their ancestral burial grounds to be sacred lands. Kaleesh are known for their warlike nature and protectiveness of their territory and families.","example-names": ["Qymaen jai Sheelal","Ronderu lij Kummar","Bentilais san Sk\'ar"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": -2,"con": 2,"int": -2,"wis": 0,"cha": 2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "A Kaleesh with Survival as a Trained Skill gains Skill Focus (Survival) as a bonus Feat."},{"name": "Darkvision","description": "Kaleesh ignore Concealment (including Total Concealment) from darkness, but cannot perceive colors in total darkness."},{"name": "Driven","description": "Kaleesh gain a +5 Species bonus to their Will Defense against Mind-Affecting effects due to their focused nature."},{"name": "Persistent","description": "A Kaleesh can reroll any Endurance check, but must accept the result of the reroll, even if it is worse."}],"automatic-language": ["Basic","Kaleesh"]}},"Kaminoan": {"name": "Kaminoan","description": "Kaminoans are a tall, genetically adaptable Species from the planet Kamino. They excel in cloning and possess keen analytical abilities. Kaminoans value perfection and are somewhat xenophobic, rarely leaving their homeworld.","example-names": ["Ava Lim","Lama Su","Maru Lan","Tau Shei","Taga Sai","Seva Ke","Taun We"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 0,"int": 2,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "A Kaminoan with Treat Injury as a Trained Skill gains Skill Focus (Treat Injury) as a bonus Feat."},{"name": "Resilient","description": "Kaminoans gain a +1 Species bonus to their Fortitude Defense due to scientific refinements in their genetic code."}],"automatic-language": ["Basic","Kaminoan"]}},"Kel-Dor": {"name": "Kel Dor","description": "Kel Dor are a calm and kind Species native to the helium-rich atmosphere of Dorin. They cannot breathe in nitrogen/oxygen atmospheres without special equipment. Kel Dor are known for their sense of justice and altruism.","example-names": ["Dorn Tlo","Plo Koon","Torin Dol"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 2,"con": -2,"int": 0,"wis": 2,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Keen Force Sense","description": "Kel Dor may reroll any Use the Force check made to Search Your Feelings or Sense Force and keep the better result."},{"name": "Low-Light Vision","description": "Kel Dor ignore Concealment (but not Total Concealment) from darkness."}],"special-equipment": "Kel Dor require breath masks and goggles to survive outside Dorin\'s atmosphere. Without them, they cannot breathe or see.","automatic-language": ["Basic","Kel Dor"]}},"Mon-Calamari": {"name": "Mon Calamari","description": "Mon Calamari are amphibious land-dwellers known for their analytical abilities and ship design prowess. They value peace but are willing to fight for their beliefs. Mon Calamari have a reputation for being idealistic and daring.","example-names": ["Ackbar","Bant","Cilhal","Ibtisam","Jesmin","Oro","Perit","Rekara"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": -2,"int": 2,"wis": 2,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Breathe Underwater","description": "Mon Calamari cannot drown in water due to their amphibious nature."},{"name": "Conditional Bonus Feat","description": "A Mon Calamari with Perception as a Trained Skill gains Skill Focus (Perception) as a bonus Feat."},{"name": "Expert Swimmer","description": "Mon Calamari can reroll any Swim check, but must accept the result of the reroll, even if it is worse. They can also Take 10 on Swim checks, even when distracted or threatened."},{"name": "Low-Light Vision","description": "Mon Calamari ignore Concealment (but not Total Concealment) from darkness."}],"automatic-language": ["Basic","Mon Calamarian"]}},"Nautolan": {"name": "Nautolan","description": "Nautolans are one of the sentient Species native to the planet Glee Anselm. Their language, Nautila, evolved underwater and is heavily tied to pheromones. Out of water, Nautila loses much of its meaning. As a result, Nautolans learn another language, typically either Basic or Anselmian, the language of the Anselmi people, who are native to Glee Anselm\'s land masses. Nautolans are hardy and excellent swimmers.","example-names": ["Hiskar Dorset","Kit Fisto","Ploss Niklos","Renko Losa","Pin Mako","Setel Yast"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 2,"int": -2,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Breathe Underwater","description": "Nautolans can\'t drown in water."},{"name": "Damage Reduction","description": "Nautolans have a Damage Reduction 2 due to their rubbery hide."},{"name": "Expert Swimmer","description": "A Nautolan may reroll any Swim check, but must accept the result of the reroll. Additionally, a Nautolan can Take 10 on Swim checks even when distracted or threatened."},{"name": "Low-Light Vision","description": "Nautolans ignore Concealment (but not Total Concealment) from darkness."},{"name": "Pheromonal Sensor","description": "A Nautolan can reroll any Perception check made to Sense Deception or Sense Influence, but must accept the result of the reroll. If underwater, the Nautolan can take the better of the two results instead."}],"automatic-language": ["Nautila","Basic"]}},"Quarren": {"name": "Quarren","description": "Quarren hail from the distant Outer Rim planet of Mon Calamari, sharing the world with the sentient humanoid Species of the same name. Quarren generally stay clear of galactic politics, involving themselves in shadowy occupations such as pirates, smugglers, and spy networks. They tend to blame both the Empire and the Rebels for their homeworld\'s devastation during the Galactic Civil War.","example-names": ["Kelmut","Seggor","Tessek","Tsillin","Vekker","Vuhlg"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 2,"int": 0,"wis": -2,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Breathe Underwater","description": "Quarren can\'t drown in water."},{"name": "Conditional Bonus Feat","description": "A Quarren with Persuasion as a Trained Skill gains Skill Focus (Persuasion) as a bonus Feat."},{"name": "Expert Swimmer","description": "A Quarren may reroll any Swim check, but must accept the result of the reroll. Additionally, a Quarren can Take 10 on Swim checks even when distracted or threatened."},{"name": "Low-Light Vision","description": "Quarren ignore Concealment (but not Total Concealment) from darkness."}],"automatic-language": ["Quarrenese","Basic"]}},"Rodian": {"name": "Rodian","description": "Rodians hail from the Tyrius System of The Mid Rim, evolving into brutal hunters and killers to survive the humid and dangerous rainforests of their homeworld. Rodians view bounty hunting as the most honorable profession and often glorify violence and stalking prey. Many become renowned bounty hunters.","example-names": ["Andoorni","Beedo","Chido","Doda","Greedo","Greeata","Kelko","Navik","Neela","Neesh","Wald"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 2,"con": 0,"int": 0,"wis": 0,"cha": -2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Conditional Bonus Feat","description": "A Rodian with Survival as a Trained Skill gains Skill Focus (Survival) as a bonus Feat."},{"name": "Heightened Awareness","description": "A Rodian may reroll any Perception check, but must accept the result of the reroll."},{"name": "Low-Light Vision","description": "Rodians ignore Concealment (but not Total Concealment) from darkness."}],"automatic-language": ["Rodese","Basic"]}},"Togruta": {"name": "Togruta","description": "Togrutas are natives of the planet Shili, known for their brightly colored horns, head-tails, and skin. They are natural pack hunters and work effectively in large groups. Togrutas are social, outspoken, perceptive, and attentive, preferring to work in groups and adept at complex social interaction.","example-names": ["Ahsoka Tano","Ashla","Codi Ty","Creev Zrgaat","Dyani Zaan","Jir Taalan","Qusak Laal","Raana Tey","Shaak Ti","Vika Saaris"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": -2,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Pack Hunter","description": "Togrutas deal an additional 2 points of damage on melee attacks against opponents they Flank."},{"name": "Sneaky","description": "A Togruta may reroll any Stealth check to Sneak, but must accept the result of the reroll."},{"name": "Spatial Awareness","description": "Togrutas can sense their surroundings using passive echolocation. They ignore all Cover and Concealment when making Perception checks to Notice Targets within 10 spaces."}],"automatic-language": ["Togruti","Basic"]}},"Trandoshan": {"name": "Trandoshan","description": "Trandoshans are known for their great strength and warlike natures. Many dedicate themselves to martial training or become renowned bounty hunters. They have a long-standing enmity with Wookiees and are often violent, brutal, and driven, though they can show compassion and mercy as the situation warrants.","example-names": ["Bossk","Fusset","Krussk","Ssuurg","Tusserk"],"species-traits": {"ability-score-adjustment": {"str": 2,"dex": -2,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Bonus Feat","description": "Trandoshans receive the Toughness feat at 1st level as a bonus Feat."},{"name": "Darkvision","description": "Trandoshans ignore Concealment (including Total Concealment) from darkness. However, they cannot perceive colors in total darkness."},{"name": "Limb Regeneration","description": "A Trandoshan regrows a lost limb in 1d10 days. At the end of that time, all Persistent Conditions associated with the loss of the limb are removed."},{"name": "Natural Armor","description": "Trandoshans have thick scales that provide a +1 Natural Armor bonus to their Reflex Defense."}],"automatic-language": ["Dosh","Basic"]}},"Twi\'lek": {"name": "Twi\'lek","description": "From the dry, rocky world of Ryloth, Twi\'leks have made a place for themselves along the Galaxy. These tall, thin humanoids include a variety of distinct subraces, but all are instantly recognizable by the tentacular \'Head-Tails\' (called Lekku) that protrude from the backs of their heads. Sly, calculating beings, Twi\'leks prefer to avoid trouble and stick to the shadows until an opportunity to act without undue danger to themselves presents itself. Their entrepreneurial spirit frequently leads them to positions of influence, and Twi\'lek corporate executives and ambassadors are no less common than unscrupulous Twi\'lek freighter captains and crime lords.","example-names": ["Bib Fortuna","Deel Surool","Firith Olan","Koyi Komad","Lyn Me","Oola","Tott Doneeta"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 0,"int": 0,"wis": -2,"cha": 2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Deceptive","description": "Naturally gifted at manipulation, a Twi\'lek may choose to reroll any Deception check, but the result of the reroll must be accepted, even if it is worse."},{"name": "Great Fortitude","description": "Twi\'leks gain a +2 Species bonus to their Fortitude Defense. Twi\'leks have great health with a natural resistance to toxins and illnesses."}],"automatic-language": ["Basic","Ryl"]}},"Wookiee": {"name": "Wookiee","description": "Wookiees are widely recognized as one of the strongest and fiercest intelligent Species in the galaxy. Wookiees have many customs and traditions that revolve around honor and loyalty, including the special bond called the honor family and the sacred pledge called the Life Debt. A Wookiee never uses his or her climbing claws in combat; doing this is considered dishonorable and a sign of madness.","example-names": ["Chewbacca","Gorwooken","Groznik","Lowbacca","Ralrra","Rorworr","Salporin"],"species-traits": {"ability-score-adjustment": {"str": 4,"dex": -2,"con": 2,"int": -2,"wis": -2,"cha": -2,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Expert Climber","description": "Wookiees are great climbers and may choose to Take 10 on Climb checks, even when distracted or threatened."},{"name": "Extraordinary Recuperation","description": "A Wookiee\’s injuries (such as crippled limbs) heal at double the normal rate (see Natural Healing)."},{"name": "Intimidating Presence","description": "Known to pull off the ears of Gundarks, Wookiees may choose to reroll any Persuasion check made to Intimidate others, but the result of the reroll must be accepted, even if it is worse."},{"name": "Rage","description": "Once per day, a Wookiee can fly into a Rage as a Swift Action. While Raging, the Wookiee temporarily gains a +2 Rage bonus on melee attack rolls and melee damage rolls, but cannot use Skills that require patience and concentration, such as Mechanics, Stealth, or Use the Force."},{"name": "Weapon Familiarity (Bowcaster and Ryyk Blade)","description": "Wookiees treat the Bowcaster as a Rifle instead of an Exotic Weapon (Ranged). They additionally treat the Ryyk Blade as an Advanced Melee Weapon instead of an Exotic Weapon (Melee)."}],"automatic-language": ["Shyriiwook"]}},"Zabrak": {"name": "Zabrak","description": "The Zabrak are an early spacefaring race distinguished by patterns of vestigial horns on their heads. Zabrak hail from many worlds and have been spacefarers for so long that they define themselves and each other according to their colony of origin. The harshness of Iridonia, their homeworld, forged in the Zabrak an iron will to survive. Driven to escape their world, they sought to obtain the knowledge of space flight.","example-names": ["Aagh Odok","Eeth Koth","Kooth Aan","Bao Dur"],"species-traits": {"ability-score-adjustment": {"str": 0,"dex": 0,"con": 0,"int": 0,"wis": 0,"cha": 0,"wil": 0},"size": "Medium","speed": 6,"bonus-traits": [{"name": "Heightened Awareness","description": "Having strong survival instincts and quick reactions, a Zabrak may choose to reroll any Perception check, but the result of the reroll must be accepted, even if it is worse."},{"name": "Superior Defenses","description": "Adapted to a very tough and trying environment, Zabrak gain a +1 Species bonus to all their Defenses."}],"automatic-language": ["Basic","Zabrak"]}}}'